#include <pgmspace.h>
#include <stdint.h>

const unsigned short ditieicon[630] PROGMEM = {
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69,
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, // 0x0010 (16) pixels
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69,
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, // 0x0020 (32) pixels
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69,
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, // 0x0030 (48) pixels
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69,
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, // 0x0040 (64) pixels
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69,
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, // 0x0050 (80) pixels
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69,
    0xFF69, 0xFF69, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, // 0x0060 (96) pixels
    0xE8C4, 0xE8C4, 0xE8C4, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69,
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xE8C4, 0xE8C4, 0xE8C4, // 0x0070 (112) pixels
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4,
    0xE8C4, 0xE8C4, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, // 0x0080 (128) pixels
    0xFF69, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4,
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, // 0x0090 (144) pixels
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xE8C4, 0xE8C4, 0xE8C4,
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, // 0x00A0 (160) pixels
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xFF69, 0xFF69,
    0xFF69, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, // 0x00B0 (176) pixels
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xE8C4, 0xE8C4, 0xE8C4,
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xFF69, 0xFF69, 0xE8C4, 0xE8C4, // 0x00C0 (192) pixels
    0xE8C4, 0xE8C4, 0xE8C4, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69,
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, // 0x00D0 (208) pixels
    0xE8C4, 0xFF69, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xFF69,
    0xFF69, 0xE8C4, 0xE8C4, 0xFF69, 0xFF69, 0xFF69, 0xE8C4, 0xE8C4, // 0x00E0 (224) pixels
    0xFF69, 0xFF69, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4,
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xFF69, 0xE8C4, 0xE8C4, 0xE8C4, // 0x00F0 (240) pixels
    0xE8C4, 0xFF69, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xFF69, 0xE8C4,
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, // 0x0100 (256) pixels
    0xFF69, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4,
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xFF69, 0xE8C4, 0xE8C4, 0xE8C4, // 0x0110 (272) pixels
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4,
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, // 0x0120 (288) pixels
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4,
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, // 0x0130 (304) pixels
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4,
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, // 0x0140 (320) pixels
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4,
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, // 0x0150 (336) pixels
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4,
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, // 0x0160 (352) pixels
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4,
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xFF69, 0xFF69, 0xE8C4, 0xE8C4, // 0x0170 (368) pixels
    0xE8C4, 0xFF69, 0xFF69, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4,
    0xE8C4, 0xE8C4, 0xFF69, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xFF69, // 0x0180 (384) pixels
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xE8C4, 0xFF69, 0xFF69, 0xFF69,
    0xFF69, 0xFF69, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, // 0x0190 (400) pixels
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xFF69, 0xFF69, 0xFF69, 0xFF69,
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xE8C4, // 0x01A0 (416) pixels
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xFF69, 0xE8C4, 0xE8C4, 0xE8C4,
    0xE8C4, 0xE8C4, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, // 0x01B0 (432) pixels
    0xFF69, 0xFF69, 0xFF69, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4,
    0xFF69, 0xFF69, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, // 0x01C0 (448) pixels
    0xE8C4, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xE8C4, 0xE8C4,
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xFF69, 0xFF69, 0xFF69, // 0x01D0 (464) pixels
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4,
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, // 0x01E0 (480) pixels
    0xE8C4, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xE8C4, 0xE8C4,
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, // 0x01F0 (496) pixels
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xFF69, 0xFF69, 0xFF69,
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, // 0x0200 (512) pixels
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4,
    0xE8C4, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, // 0x0210 (528) pixels
    0xFF69, 0xFF69, 0xFF69, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4,
    0xE8C4, 0xE8C4, 0xE8C4, 0xE8C4, 0xFF69, 0xFF69, 0xFF69, 0xFF69, // 0x0220 (544) pixels
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69,
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, // 0x0230 (560) pixels
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69,
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, // 0x0240 (576) pixels
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69,
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, // 0x0250 (592) pixels
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69,
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, // 0x0260 (608) pixels
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69,
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, // 0x0270 (624) pixels
    0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69, 0xFF69};

const uint16_t line_colors[] = {0xE005, 0x8E04, 0xFEA0, 0x40F0, 0x9273, 0xD00D, 0xEB60, 0x04BB, 0x865D, 0xC57A,
                                0x80C5, 0x03CC, 0xECD8, 0x6304, 0xC571, 0x9E98, 0xB3AD, 0xC4AA, 0x8C51};

const char line_names[][10] = {
    "1号线",  "2号线",  "3号线",  "4号线",  "5号线",  "6号线",  "7号线",  "8号线",  "9号线",  "10号线",
    "11号线", "12号线", "13号线", "14号线", "15号线", "16号线", "17号线", "18号线", "浦江线",
};

const uint16_t edges[][3] = {
    {0, 1, 3},   // 莘庄, 外环路
    {1, 2, 3},   // 外环路, 莲花路
    {2, 3, 3},   // 莲花路, 锦江乐园
    {3, 4, 3},   // 锦江乐园, 上海南站
    {4, 5, 3},   // 上海南站, 漕宝路
    {5, 6, 3},   // 漕宝路, 上海体育馆
    {6, 7, 3},   // 上海体育馆, 徐家汇
    {7, 8, 3},   // 徐家汇, 衡山路
    {8, 9, 3},   // 衡山路, 常熟路
    {9, 10, 3},  // 常熟路, 陕西南路
    {10, 11, 3}, // 陕西南路, 一大会址·黄陂南路
    {11, 12, 3}, // 一大会址·黄陂南路, 人民广场
    {12, 13, 3}, // 人民广场, 新闸路
    {13, 14, 3}, // 新闸路, 汉中路
    {14, 15, 3}, // 汉中路, 上海火车站
    {15, 16, 3}, // 上海火车站, 中山北路
    {16, 17, 3}, // 中山北路, 延长路
    {17, 18, 3}, // 延长路, 上海马戏城
    {18, 19, 3}, // 上海马戏城, 汶水路
    {19, 20, 3}, // 汶水路, 彭浦新村
    {20, 21, 3}, // 彭浦新村, 共康路
    {21, 22, 3}, // 共康路, 通河新村
    {22, 23, 3}, // 通河新村, 呼兰路
    {23, 24, 3}, // 呼兰路, 共富新村
    {24, 25, 3}, // 共富新村, 宝安公路
    {25, 26, 3}, // 宝安公路, 友谊西路
    {26, 27, 3}, // 友谊西路, 富锦路

    {28, 29, 3}, // 徐泾东, 虹桥火车站
    {29, 30, 3}, // 虹桥火车站, 虹桥2号航站楼
    {30, 31, 3}, // 虹桥2号航站楼, 淞虹路
    {31, 32, 3}, // 淞虹路, 北新泾
    {32, 33, 3}, // 北新泾, 威宁路
    {33, 34, 3}, // 威宁路, 娄山关路
    {34, 35, 3}, // 娄山关路, 中山公园
    {35, 36, 3}, // 中山公园, 江苏路
    {36, 37, 3}, // 江苏路, 静安寺
    {37, 38, 3}, // 静安寺, 南京西路
    {38, 39, 3}, // 南京西路, 人民广场
    {39, 40, 3}, // 人民广场, 南京东路
    {40, 41, 3}, // 南京东路, 陆家嘴
    {41, 42, 3}, // 陆家嘴, 东昌路
    {42, 43, 3}, // 东昌路, 世纪大道
    {43, 44, 3}, // 世纪大道, 上海科技馆
    {44, 45, 3}, // 上海科技馆, 世纪公园
    {45, 46, 3}, // 世纪公园, 龙阳路
    {46, 47, 3}, // 龙阳路, 张江高科
    {47, 48, 3}, // 张江高科, 金科路
    {48, 49, 3}, // 金科路, 广兰路
    {49, 50, 3}, // 广兰路, 唐镇
    {50, 51, 3}, // 唐镇, 创新中路
    {51, 52, 3}, // 创新中路, 华夏东路
    {52, 53, 3}, // 华夏东路, 川沙
    {53, 54, 3}, // 川沙, 凌空路
    {54, 55, 3}, // 凌空路, 远东大道
    {55, 56, 3}, // 远东大道, 海天三路
    {56, 57, 3}, // 海天三路, 浦东国际机场

    {58, 59, 3}, // 上海南站, 石龙路
    {59, 60, 3}, // 石龙路, 龙漕路
    {60, 61, 3}, // 龙漕路, 漕溪路
    {61, 62, 3}, // 漕溪路, 宜山路
    {62, 63, 3}, // 宜山路, 虹桥路
    {63, 64, 3}, // 虹桥路, 延安西路
    {64, 65, 3}, // 延安西路, 中山公园
    {65, 66, 3}, // 中山公园, 金沙江路
    {66, 67, 3}, // 金沙江路, 曹杨路
    {67, 68, 3}, // 曹杨路, 镇坪路
    {68, 69, 3}, // 镇坪路, 中潭路
    {69, 70, 3}, // 中潭路, 上海火车站
    {70, 71, 3}, // 上海火车站, 宝山路
    {71, 72, 3}, // 宝山路, 东宝兴路
    {72, 73, 3}, // 东宝兴路, 虹口足球场
    {73, 74, 3}, // 虹口足球场, 赤峰路
    {74, 75, 3}, // 赤峰路, 大柏树
    {75, 76, 3}, // 大柏树, 江湾镇
    {76, 77, 3}, // 江湾镇, 殷高西路
    {77, 78, 3}, // 殷高西路, 长江南路
    {78, 79, 3}, // 长江南路, 淞发路
    {79, 80, 3}, // 淞发路, 张华浜
    {80, 81, 3}, // 张华浜, 淞滨路
    {81, 82, 3}, // 淞滨路, 水产路
    {82, 83, 3}, // 水产路, 宝杨路
    {83, 84, 3}, // 宝杨路, 友谊路
    {84, 85, 3}, // 友谊路, 铁力路
    {85, 86, 3}, // 铁力路, 江杨北路

    {87, 88, 3},   // 上海体育馆, 宜山路
    {88, 89, 3},   // 宜山路, 虹桥路
    {89, 90, 3},   // 虹桥路, 延安西路
    {90, 91, 3},   // 延安西路, 中山公园
    {91, 92, 3},   // 中山公园, 金沙江路
    {92, 93, 3},   // 金沙江路, 曹杨路
    {93, 94, 3},   // 曹杨路, 镇坪路
    {94, 95, 3},   // 镇坪路, 中潭路
    {95, 96, 3},   // 中潭路, 上海火车站
    {96, 97, 3},   // 上海火车站, 宝山路
    {97, 98, 3},   // 宝山路, 海伦路
    {98, 99, 3},   // 海伦路, 临平路
    {99, 100, 3},  // 临平路, 大连路
    {100, 101, 3}, // 大连路, 杨树浦路
    {101, 102, 3}, // 杨树浦路, 浦东大道
    {102, 103, 3}, // 浦东大道, 世纪大道
    {103, 104, 3}, // 世纪大道, 浦电路
    {104, 105, 3}, // 浦电路, 蓝村路
    {105, 106, 3}, // 蓝村路, 塘桥
    {106, 107, 3}, // 塘桥, 南浦大桥
    {107, 108, 3}, // 南浦大桥, 西藏南路
    {108, 109, 3}, // 西藏南路, 鲁班路
    {109, 110, 3}, // 鲁班路, 大木桥路
    {110, 111, 3}, // 大木桥路, 东安路
    {111, 112, 3}, // 东安路, 上海体育场
    {112, 87, 3},  // 上海体育场, 上海体育馆 NOTE: 4号线 环线

    {113, 114, 3}, // 莘庄, 春申路
    {114, 115, 3}, // 春申路, 银都路
    {115, 116, 3}, // 银都路, 颛桥
    {116, 117, 3}, // 颛桥, 北桥
    {117, 118, 3}, // 北桥, 剑川路
    {118, 119, 3}, // 剑川路, 东川路
    {119, 120, 3}, // 东川路, 金平路
    {120, 121, 3}, // 金平路, 华宁路
    {121, 122, 3}, // 华宁路, 文井路
    {122, 123, 3}, // 文井路, 闵行开发区
    {119, 124, 3}, // 东川路, 江川路
    {124, 125, 3}, // 江川路, 西渡
    {125, 126, 3}, // 西渡, 萧塘
    {126, 127, 3}, // 萧塘, 奉浦大道
    {127, 128, 3}, // 奉浦大道, 环城东路
    {128, 129, 3}, // 环城东路, 望园路
    {129, 130, 3}, // 望园路, 金海湖
    {130, 131, 3}, // 金海湖, 奉贤新城

    {132, 133, 3}, // 东方体育中心, 灵岩南路
    {133, 134, 3}, // 灵岩南路, 上南路
    {134, 135, 3}, // 上南路, 华夏西路
    {135, 136, 3}, // 华夏西路, 高青路
    {136, 137, 3}, // 高青路, 东明路
    {137, 138, 3}, // 东明路, 高科西路
    {138, 139, 3}, // 高科西路, 临沂新村
    {139, 140, 3}, // 临沂新村, 上海儿童医学中心
    {140, 141, 3}, // 上海儿童医学中心, 蓝村路
    {141, 142, 3}, // 蓝村路, 浦电路
    {142, 143, 3}, // 浦电路, 世纪大道
    {143, 144, 3}, // 世纪大道, 源深体育中心
    {144, 145, 3}, // 源深体育中心, 民生路
    {145, 146, 3}, // 民生路, 北洋泾路
    {146, 147, 3}, // 北洋泾路, 德平路
    {147, 148, 3}, // 德平路, 云山路
    {148, 149, 3}, // 云山路, 金桥路
    {149, 150, 3}, // 金桥路, 博兴路
    {150, 151, 3}, // 博兴路, 五莲路
    {151, 152, 3}, // 五莲路, 巨峰路
    {152, 153, 3}, // 巨峰路, 东靖路
    {153, 154, 3}, // 东靖路, 五洲大道
    {154, 155, 3}, // 五洲大道, 洲海路
    {155, 156, 3}, // 洲海路, 外高桥保税区南站
    {156, 157, 3}, // 外高桥保税区南站, 航津路
    {157, 158, 3}, // 航津路, 外高桥保税区北站
    {158, 159, 3}, // 外高桥保税区北站, 港城路

    {160, 161, 3}, // 美兰湖, 罗南新村
    {161, 162, 3}, // 罗南新村, 潘广路
    {162, 163, 3}, // 潘广路, 刘行
    {163, 164, 3}, // 刘行, 顾村公园
    {164, 165, 3}, // 顾村公园, 祁华路
    {165, 166, 3}, // 祁华路, 上海大学
    {166, 167, 3}, // 上海大学, 南陈路
    {167, 168, 3}, // 南陈路, 上大路
    {168, 169, 3}, // 上大路, 场中路
    {169, 170, 3}, // 场中路, 大场镇
    {170, 171, 3}, // 大场镇, 行知路
    {171, 172, 3}, // 行知路, 大华三路
    {172, 173, 3}, // 大华三路, 新村路
    {173, 174, 3}, // 新村路, 岚皋路
    {174, 175, 3}, // 岚皋路, 镇坪路
    {175, 176, 3}, // 镇坪路, 长寿路
    {176, 177, 3}, // 长寿路, 昌平路
    {177, 178, 3}, // 昌平路, 静安寺
    {178, 179, 3}, // 静安寺, 常熟路
    {179, 180, 3}, // 常熟路, 肇嘉浜路
    {180, 181, 3}, // 肇嘉浜路, 东安路
    {181, 182, 3}, // 东安路, 龙华中路
    {182, 183, 3}, // 龙华中路, 后滩
    {183, 184, 3}, // 后滩, 长清路
    {184, 185, 3}, // 长清路, 耀华路
    {185, 186, 3}, // 耀华路, 云台路
    {186, 187, 3}, // 云台路, 高科西路
    {187, 188, 3}, // 高科西路, 杨高南路
    {188, 189, 3}, // 杨高南路, 锦绣路
    {189, 190, 3}, // 锦绣路, 芳华路
    {190, 191, 3}, // 芳华路, 龙阳路
    {191, 192, 3}, // 龙阳路, 花木路

    {193, 194, 3}, // 沈杜公路, 联航路
    {194, 195, 3}, // 联航路, 江月路
    {195, 196, 3}, // 江月路, 浦江镇
    {196, 197, 3}, // 浦江镇, 芦恒路
    {197, 198, 3}, // 芦恒路, 凌兆新村
    {198, 199, 3}, // 凌兆新村, 东方体育中心
    {199, 200, 3}, // 东方体育中心, 杨思成山路
    {200, 201, 3}, // 杨思成山路, 耀华路
    {201, 202, 3}, // 耀华路, 中华艺术宫
    {202, 203, 3}, // 中华艺术宫, 西藏南路
    {203, 204, 3}, // 西藏南路, 陆家浜路
    {204, 205, 3}, // 陆家浜路, 老西门
    {205, 206, 3}, // 老西门, 大世界
    {206, 207, 3}, // 大世界, 人民广场
    {207, 208, 3}, // 人民广场, 曲阜路
    {208, 209, 3}, // 曲阜路, 中兴路
    {209, 210, 3}, // 中兴路, 西藏北路
    {210, 211, 3}, // 西藏北路, 虹口足球场
    {211, 212, 3}, // 虹口足球场, 曲阳路
    {212, 213, 3}, // 曲阳路, 四平路
    {213, 214, 3}, // 四平路, 鞍山新村
    {214, 215, 3}, // 鞍山新村, 江浦路
    {215, 216, 3}, // 江浦路, 黄兴路
    {216, 217, 3}, // 黄兴路, 延吉中路
    {217, 218, 3}, // 延吉中路, 黄兴公园
    {218, 219, 3}, // 黄兴公园, 翔殷路
    {219, 220, 3}, // 翔殷路, 嫩江路
    {220, 221, 3}, // 嫩江路, 市光路

    {222, 223, 3}, // 松江南站, 醉白池
    {223, 224, 3}, // 醉白池, 松江体育中心
    {224, 225, 3}, // 松江体育中心, 松江新城
    {225, 226, 3}, // 松江新城, 松江大学城
    {226, 227, 3}, // 松江大学城, 洞泾
    {227, 228, 3}, // 洞泾, 佘山
    {228, 229, 3}, // 佘山, 泗泾
    {229, 230, 3}, // 泗泾, 九亭
    {230, 231, 3}, // 九亭, 中春路
    {231, 232, 3}, // 中春路, 七宝
    {232, 233, 3}, // 七宝, 星中路
    {233, 234, 3}, // 星中路, 合川路
    {234, 235, 3}, // 合川路, 漕河泾开发区
    {235, 236, 3}, // 漕河泾开发区, 桂林路
    {236, 237, 3}, // 桂林路, 宜山路
    {237, 238, 3}, // 宜山路, 徐家汇
    {238, 239, 3}, // 徐家汇, 肇嘉浜路
    {239, 240, 3}, // 肇嘉浜路, 嘉善路
    {240, 241, 3}, // 嘉善路, 打浦桥
    {241, 242, 3}, // 打浦桥, 马当路
    {242, 243, 3}, // 马当路, 陆家浜路
    {243, 244, 3}, // 陆家浜路, 小南门
    {244, 245, 3}, // 小南门, 商城路
    {245, 246, 3}, // 商城路, 世纪大道
    {246, 247, 3}, // 世纪大道, 杨高中路
    {247, 248, 3}, // 杨高中路, 芳甸路
    {248, 249, 3}, // 芳甸路, 蓝天路
    {249, 250, 3}, // 蓝天路, 台儿庄路
    {250, 251, 3}, // 台儿庄路, 金桥
    {251, 252, 3}, // 金桥, 金吉路
    {252, 253, 3}, // 金吉路, 金海路
    {253, 254, 3}, // 金海路, 顾唐路
    {254, 255, 3}, // 顾唐路, 民雷路
    {255, 256, 3}, // 民雷路, 曹路

    {257, 258, 3}, // 航中路, 紫藤路
    {258, 259, 3}, // 紫藤路, 龙柏新村
    {259, 264, 3}, // 龙柏新村, 龙溪路
    {260, 261, 3}, // 虹桥火车站, 虹桥2号航站楼
    {261, 262, 3}, // 虹桥2号航站楼, 虹桥1号航站楼
    {262, 263, 3}, // 虹桥1号航站楼, 上海动物园
    {263, 264, 3}, // 上海动物园, 龙溪路
    {264, 265, 3}, // 龙溪路, 水城路
    {265, 266, 3}, // 水城路, 伊犁路
    {266, 267, 3}, // 伊犁路, 宋园路
    {267, 268, 3}, // 宋园路, 虹桥路
    {268, 269, 3}, // 虹桥路, 交通大学
    {269, 270, 3}, // 交通大学, 上海图书馆
    {270, 271, 3}, // 上海图书馆, 陕西南路
    {271, 272, 3}, // 陕西南路, 一大会址·新天地
    {272, 273, 3}, // 一大会址·新天地, 老西门
    {273, 274, 3}, // 老西门, 豫园
    {274, 275, 3}, // 豫园, 南京东路
    {275, 276, 3}, // 南京东路, 天潼路
    {276, 277, 3}, // 天潼路, 四川北路
    {277, 278, 3}, // 四川北路, 海伦路
    {278, 279, 3}, // 海伦路, 邮电新村
    {279, 280, 3}, // 邮电新村, 四平路
    {280, 281, 3}, // 四平路, 同济大学
    {281, 282, 3}, // 同济大学, 国权路
    {282, 283, 3}, // 国权路, 五角场
    {283, 284, 3}, // 五角场, 江湾体育场
    {284, 285, 3}, // 江湾体育场, 三门路
    {285, 286, 3}, // 三门路, 殷高东路
    {286, 287, 3}, // 殷高东路, 新江湾城
    {287, 288, 3}, // 新江湾城, 国帆路
    {288, 289, 3}, // 国帆路, 双江路
    {289, 290, 3}, // 双江路, 高桥西
    {290, 291, 3}, // 高桥西, 高桥
    {291, 292, 3}, // 高桥, 港城路
    {292, 293, 3}, // 港城路, 基隆路

    {294, 295, 3}, // 花桥, 光明路
    {295, 296, 3}, // 光明路, 兆丰路
    {296, 297, 3}, // 兆丰路, 安亭
    {297, 298, 3}, // 安亭, 上海汽车城
    {298, 299, 3}, // 上海汽车城, 昌吉东路
    {299, 300, 3}, // 昌吉东路, 上海赛车场
    {300, 304, 3}, // 上海赛车场, 嘉定新城
    {301, 302, 3}, // 嘉定北, 嘉定西
    {302, 303, 3}, // 嘉定西, 白银路
    {303, 304, 3}, // 白银路, 嘉定新城
    {304, 305, 3}, // 嘉定新城, 马陆
    {305, 306, 3}, // 马陆, 陈翔公路
    {306, 307, 3}, // 陈翔公路, 南翔
    {307, 308, 3}, // 南翔, 桃浦新村
    {308, 309, 3}, // 桃浦新村, 武威路
    {309, 310, 3}, // 武威路, 祁连山路
    {310, 311, 3}, // 祁连山路, 李子园
    {311, 312, 3}, // 李子园, 上海西站
    {312, 313, 3}, // 上海西站, 真如
    {313, 314, 3}, // 真如, 枫桥路
    {314, 315, 3}, // 枫桥路, 曹杨路
    {315, 316, 3}, // 曹杨路, 隆德路
    {316, 317, 3}, // 隆德路, 江苏路
    {317, 318, 3}, // 江苏路, 交通大学
    {318, 319, 3}, // 交通大学, 徐家汇
    {319, 320, 3}, // 徐家汇, 上海游泳馆
    {320, 321, 3}, // 上海游泳馆, 龙华
    {321, 322, 3}, // 龙华, 云锦路
    {322, 323, 3}, // 云锦路, 龙耀路
    {323, 324, 3}, // 龙耀路, 东方体育中心
    {324, 325, 3}, // 东方体育中心, 三林
    {325, 326, 3}, // 三林, 三林东
    {326, 327, 3}, // 三林东, 浦三路
    {327, 328, 3}, // 浦三路, 御桥
    {328, 329, 3}, // 御桥, 罗山路
    {329, 330, 3}, // 罗山路, 秀沿路
    {330, 331, 3}, // 秀沿路, 康新公路
    {331, 332, 3}, // 康新公路, 迪士尼

    {333, 334, 3}, // 七莘路, 虹莘路
    {334, 335, 3}, // 虹莘路, 顾戴路
    {335, 336, 3}, // 顾戴路, 东兰路
    {336, 337, 3}, // 东兰路, 虹梅路
    {337, 338, 3}, // 虹梅路, 虹漕路
    {338, 339, 3}, // 虹漕路, 桂林公园
    {339, 340, 3}, // 桂林公园, 漕宝路
    {340, 341, 3}, // 漕宝路, 龙漕路
    {341, 342, 3}, // 龙漕路, 龙华
    {342, 343, 3}, // 龙华, 龙华中路
    {343, 344, 3}, // 龙华中路, 大木桥路
    {344, 345, 3}, // 大木桥路, 嘉善路
    {345, 346, 3}, // 嘉善路, 陕西南路
    {346, 347, 3}, // 陕西南路, 南京西路
    {347, 348, 3}, // 南京西路, 汉中路
    {348, 349, 3}, // 汉中路, 曲阜路
    {349, 350, 3}, // 曲阜路, 天潼路
    {350, 351, 3}, // 天潼路, 国际客运中心
    {351, 352, 3}, // 国际客运中心, 提篮桥
    {352, 353, 3}, // 提篮桥, 大连路
    {353, 354, 3}, // 大连路, 江浦公园
    {354, 355, 3}, // 江浦公园, 宁国路
    {355, 356, 3}, // 宁国路, 隆昌路
    {356, 357, 3}, // 隆昌路, 爱国路
    {357, 358, 3}, // 爱国路, 复兴岛
    {358, 359, 3}, // 复兴岛, 东陆路
    {359, 360, 3}, // 东陆路, 巨峰路
    {360, 361, 3}, // 巨峰路, 杨高北路
    {361, 362, 3}, // 杨高北路, 金京路
    {362, 363, 3}, // 金京路, 申江路
    {363, 364, 3}, // 申江路, 金海路

    {365, 366, 3}, // 金运路, 金沙江西路
    {366, 367, 3}, // 金沙江西路, 丰庄
    {367, 368, 3}, // 丰庄, 祁连山南路
    {368, 369, 3}, // 祁连山南路, 真北路
    {369, 370, 3}, // 真北路, 大渡河路
    {370, 371, 3}, // 大渡河路, 金沙江路
    {371, 372, 3}, // 金沙江路, 隆德路
    {372, 373, 3}, // 隆德路, 武宁路
    {373, 374, 3}, // 武宁路, 长寿路
    {374, 375, 3}, // 长寿路, 江宁路
    {375, 376, 3}, // 江宁路, 汉中路
    {376, 377, 3}, // 汉中路, 自然博物馆
    {377, 378, 3}, // 自然博物馆, 南京西路
    {378, 379, 3}, // 南京西路, 淮海中路
    {379, 380, 3}, // 淮海中路, 一大会址·新天地
    {380, 381, 3}, // 一大会址·新天地, 马当路
    {381, 382, 3}, // 马当路, 世博会博物馆
    {382, 383, 3}, // 世博会博物馆, 世博大道
    {383, 384, 3}, // 世博大道, 长清路
    {384, 385, 3}, // 长清路, 成山路
    {385, 386, 3}, // 成山路, 东明路
    {386, 387, 3}, // 东明路, 华鹏路
    {387, 388, 3}, // 华鹏路, 下南路
    {388, 389, 3}, // 下南路, 北蔡
    {389, 390, 3}, // 北蔡, 陈春路
    {390, 391, 3}, // 陈春路, 莲溪路
    {391, 392, 3}, // 莲溪路, 华夏中路
    {392, 393, 3}, // 华夏中路, 中科路
    {393, 394, 3}, // 中科路, 学林路
    {394, 395, 3}, // 学林路, 张江路

    {396, 397, 3}, // 封浜, 乐秀路
    {397, 398, 3}, // 乐秀路, 临洮路
    {398, 399, 3}, // 临洮路, 嘉怡路
    {399, 400, 3}, // 嘉怡路, 定边路
    {400, 401, 3}, // 定边路, 真新新村
    {401, 402, 3}, // 真新新村, 真光路
    {402, 403, 3}, // 真光路, 铜川路
    {403, 404, 3}, // 铜川路, 真如
    {404, 405, 3}, // 真如, 中宁路
    {405, 406, 3}, // 中宁路, 曹杨路
    {406, 407, 3}, // 曹杨路, 武宁路
    {407, 408, 3}, // 武宁路, 武定路
    {408, 409, 3}, // 武定路, 静安寺
    {409, 410, 3}, // 静安寺, 一大会址·黄陂南路
    {410, 411, 3}, // 一大会址·黄陂南路, 大世界
    {411, 412, 3}, // 大世界, 豫园
    {412, 413, 3}, // 豫园, 陆家嘴
    {413, 414, 3}, // 陆家嘴, 浦东南路
    {414, 415, 3}, // 浦东南路, 浦东大道
    {415, 416, 3}, // 浦东大道, 源深路
    {416, 417, 3}, // 源深路, 昌邑路
    {417, 418, 3}, // 昌邑路, 歇浦路
    {418, 419, 3}, // 歇浦路, 云山路
    {419, 420, 3}, // 云山路, 蓝天路
    {420, 421, 3}, // 蓝天路, 黄杨路
    {421, 422, 3}, // 黄杨路, 云顺路
    {422, 423, 3}, // 云顺路, 浦东足球场
    {423, 424, 3}, // 浦东足球场, 金粤路
    {424, 425, 3}, // 金粤路, 桂桥路

    {426, 427, 3}, // 紫竹高新区, 永德路
    {427, 428, 3}, // 永德路, 元江路
    {428, 429, 3}, // 元江路, 双柏路
    {429, 430, 3}, // 双柏路, 曙建路
    {430, 431, 3}, // 曙建路, 景西路
    {431, 432, 3}, // 景西路, 虹梅南路
    {432, 433, 3}, // 虹梅南路, 华泾西
    {433, 434, 3}, // 华泾西, 朱梅路
    {434, 435, 3}, // 朱梅路, 罗秀路
    {435, 436, 3}, // 罗秀路, 华东理工大学
    {436, 437, 3}, // 华东理工大学, 上海南站
    {437, 438, 3}, // 上海南站, 桂林公园
    {438, 439, 3}, // 桂林公园, 桂林路
    {439, 440, 3}, // 桂林路, 吴中路
    {440, 441, 3}, // 吴中路, 姚虹路
    {441, 442, 3}, // 姚虹路, 红宝石路
    {442, 443, 3}, // 红宝石路, 娄山关路
    {443, 444, 3}, // 娄山关路, 长风公园
    {444, 445, 3}, // 长风公园, 大渡河路
    {445, 446, 3}, // 大渡河路, 梅岭北路
    {446, 447, 3}, // 梅岭北路, 铜川路
    {447, 448, 3}, // 铜川路, 上海西站
    {448, 449, 3}, // 上海西站, 武威东路
    {449, 450, 3}, // 武威东路, 古浪路
    {450, 451, 3}, // 古浪路, 祁安路
    {451, 452, 3}, // 祁安路, 南大路
    {452, 453, 3}, // 南大路, 丰翔路
    {453, 454, 3}, // 丰翔路, 锦秋路
    {454, 455, 3}, // 锦秋路, 顾村公园

    {456, 457, 3}, // 龙阳路, 华夏中路
    {457, 458, 3}, // 华夏中路, 罗山路
    {458, 459, 3}, // 罗山路, 周浦东
    {459, 460, 3}, // 周浦东, 鹤沙航城
    {460, 461, 3}, // 鹤沙航城, 航头东
    {461, 462, 3}, // 航头东, 新场
    {462, 463, 3}, // 新场, 野生动物园
    {463, 464, 3}, // 野生动物园, 惠南
    {464, 465, 3}, // 惠南, 惠南东
    {465, 466, 3}, // 惠南东, 书院
    {466, 467, 3}, // 书院, 临港大道
    {467, 468, 3}, // 临港大道, 滴水湖

    {469, 470, 3}, // 虹桥火车站, 诸光路
    {470, 471, 3}, // 诸光路, 蟠龙路
    {471, 472, 3}, // 蟠龙路, 徐盈路
    {472, 473, 3}, // 徐盈路, 徐泾北城
    {473, 474, 3}, // 徐泾北城, 嘉松中路
    {474, 475, 3}, // 嘉松中路, 赵巷
    {475, 476, 3}, // 赵巷, 汇金路
    {476, 477, 3}, // 汇金路, 青浦新城
    {477, 478, 3}, // 青浦新城, 漕盈路
    {478, 479, 3}, // 漕盈路, 淀山湖大道
    {479, 480, 3}, // 淀山湖大道, 朱家角
    {480, 481, 3}, // 朱家角, 东方绿舟

    {482, 483, 3}, // 航头, 下沙
    {483, 484, 3}, // 下沙, 鹤涛路
    {484, 485, 3}, // 鹤涛路, 沈梅路
    {485, 486, 3}, // 沈梅路, 繁荣路
    {486, 487, 3}, // 繁荣路, 周浦
    {487, 488, 3}, // 周浦, 康桥
    {488, 489, 3}, // 康桥, 御桥
    {489, 490, 3}, // 御桥, 莲溪路
    {490, 491, 3}, // 莲溪路, 北中路
    {491, 492, 3}, // 北中路, 芳芯路
    {492, 493, 3}, // 芳芯路, 龙阳路
    {493, 494, 3}, // 龙阳路, 迎春路
    {494, 495, 3}, // 迎春路, 杨高中路
    {495, 496, 3}, // 杨高中路, 民生路
    {496, 497, 3}, // 民生路, 昌邑路
    {497, 498, 3}, // 昌邑路, 丹阳路
    {498, 499, 3}, // 丹阳路, 平凉路
    {499, 500, 3}, // 平凉路, 江浦公园
    {500, 501, 3}, // 江浦公园, 江浦路
    {501, 502, 3}, // 江浦路, 抚顺路
    {502, 503, 3}, // 抚顺路, 国权路
    {503, 504, 3}, // 国权路, 复旦大学
    {504, 505, 3}, // 复旦大学, 上海财经大学
    {505, 506, 3}, // 上海财经大学, 殷高路
    {506, 507, 3}, // 殷高路, 长江南路

    {508, 509, 3}, // 沈杜公路, 三鲁公路
    {509, 510, 3}, // 三鲁公路, 闵瑞路
    {510, 511, 3}, // 闵瑞路, 浦航路
    {511, 512, 3}, // 浦航路, 东城一路
    {512, 513, 3}, // 东城一路, 汇臻路

    {43, 103, 10},  // 世纪大道, 世纪大道
    {43, 143, 10},  // 世纪大道, 世纪大道
    {103, 143, 10}, // 世纪大道, 世纪大道
    {43, 246, 10},  // 世纪大道, 世纪大道
    {103, 246, 10}, // 世纪大道, 世纪大道
    {143, 246, 10}, // 世纪大道, 世纪大道
    {46, 191, 10},  // 龙阳路, 龙阳路
    {46, 456, 10},  // 龙阳路, 龙阳路
    {191, 456, 10}, // 龙阳路, 龙阳路
    {46, 493, 10},  // 龙阳路, 龙阳路
    {191, 493, 10}, // 龙阳路, 龙阳路
    {456, 493, 10}, // 龙阳路, 龙阳路
    {12, 39, 10},   // 人民广场, 人民广场
    {12, 207, 10},  // 人民广场, 人民广场
    {39, 207, 10},  // 人民广场, 人民广场
    {4, 58, 10},    // 上海南站, 上海南站
    {4, 437, 10},   // 上海南站, 上海南站
    {58, 437, 10},  // 上海南站, 上海南站
    {35, 65, 10},   // 中山公园, 中山公园
    {35, 91, 10},   // 中山公园, 中山公园
    {65, 91, 10},   // 中山公园, 中山公园
    {66, 92, 10},   // 金沙江路, 金沙江路
    {66, 371, 10},  // 金沙江路, 金沙江路
    {92, 371, 10},  // 金沙江路, 金沙江路
    {67, 93, 10},   // 曹杨路, 曹杨路
    {67, 315, 10},  // 曹杨路, 曹杨路
    {93, 315, 10},  // 曹杨路, 曹杨路
    {67, 406, 10},  // 曹杨路, 曹杨路
    {93, 406, 10},  // 曹杨路, 曹杨路
    {315, 406, 10}, // 曹杨路, 曹杨路
    {68, 94, 10},   // 镇坪路, 镇坪路
    {68, 175, 10},  // 镇坪路, 镇坪路
    {94, 175, 10},  // 镇坪路, 镇坪路
    {62, 88, 10},   // 宜山路, 宜山路
    {62, 237, 10},  // 宜山路, 宜山路
    {88, 237, 10},  // 宜山路, 宜山路
    {63, 89, 10},   // 虹桥路, 虹桥路
    {63, 268, 10},  // 虹桥路, 虹桥路
    {89, 268, 10},  // 虹桥路, 虹桥路
    {15, 70, 10},   // 上海火车站, 上海火车站
    {15, 96, 10},   // 上海火车站, 上海火车站
    {70, 96, 10},   // 上海火车站, 上海火车站
    {37, 178, 20},  // 静安寺, 静安寺
    {37, 409, 20},  // 静安寺, 静安寺
    {178, 409, 20}, // 静安寺, 静安寺
    {132, 199, 10}, // 东方体育中心, 东方体育中心
    {132, 324, 10}, // 东方体育中心, 东方体育中心
    {199, 324, 10}, // 东方体育中心, 东方体育中心
    {10, 271, 10},  // 陕西南路, 陕西南路
    {10, 346, 10},  // 陕西南路, 陕西南路
    {271, 346, 10}, // 陕西南路, 陕西南路
    {7, 238, 8},   // 徐家汇, 徐家汇
    {7, 319, 8},   // 徐家汇, 徐家汇
    {238, 319, 8}, // 徐家汇, 徐家汇
    {29, 260, 10},  // 虹桥火车站, 虹桥火车站
    {29, 469, 10},  // 虹桥火车站, 虹桥火车站
    {260, 469, 10}, // 虹桥火车站, 虹桥火车站
    {38, 347, 10},  // 南京西路, 南京西路
    {38, 378, 10},  // 南京西路, 南京西路
    {347, 378, 10}, // 南京西路, 南京西路
    {14, 348, 10},  // 汉中路, 汉中路
    {14, 376, 10},  // 汉中路, 汉中路
    {348, 376, 10}, // 汉中路, 汉中路

    {0, 113, 10},   // 莘庄, 莘庄
    {105, 141, 10}, // 蓝村路, 蓝村路
    {104, 142, 10}, // 浦电路, 浦电路
    {9, 179, 10},   // 常熟路, 常熟路
    {111, 181, 10}, // 东安路, 东安路
    {138, 187, 10}, // 高科西路, 高科西路
    {185, 201, 10}, // 耀华路, 耀华路
    {108, 203, 10}, // 西藏南路, 西藏南路
    {6, 87, 10},    // 上海体育馆, 上海体育馆
    {64, 90, 10},   // 延安西路, 延安西路
    {69, 95, 10},   // 中潭路, 中潭路
    {71, 97, 10},   // 宝山路, 宝山路
    {73, 211, 10},  // 虹口足球场, 虹口足球场
    {180, 239, 10}, // 肇嘉浜路, 肇嘉浜路
    {204, 243, 10}, // 陆家浜路, 陆家浜路
    {30, 261, 10},  // 虹桥2号航站楼, 虹桥2号航站楼
    {205, 273, 10}, // 老西门, 老西门
    {40, 275, 10},  // 南京东路, 南京东路
    {98, 278, 10},  // 海伦路, 海伦路
    {213, 280, 10}, // 四平路, 四平路
    {159, 292, 10}, // 港城路, 港城路
    {36, 317, 10},  // 江苏路, 江苏路
    {269, 318, 10}, // 交通大学, 交通大学
    {5, 340, 10},   // 漕宝路, 漕宝路
    {60, 341, 10},  // 龙漕路, 龙漕路
    {321, 342, 10}, // 龙华, 龙华
    {182, 343, 10}, // 龙华中路, 龙华中路
    {110, 344, 10}, // 大木桥路, 大木桥路
    {240, 345, 10}, // 嘉善路, 嘉善路
    {208, 349, 10}, // 曲阜路, 曲阜路
    {276, 350, 10}, // 天潼路, 天潼路
    {100, 353, 10}, // 大连路, 大连路
    {152, 360, 10}, // 巨峰路, 巨峰路
    {253, 364, 10}, // 金海路, 金海路
    {316, 372, 10}, // 隆德路, 隆德路
    {176, 374, 10}, // 长寿路, 长寿路
    {272, 380, 10}, // 一大会址·新天地, 一大会址·新天地
    {242, 381, 10}, // 马当路, 马当路
    {184, 384, 10}, // 长清路, 长清路
    {137, 386, 10}, // 东明路, 东明路
    {313, 404, 10}, // 真如, 真如
    {373, 407, 10}, // 武宁路, 武宁路
    {206, 411, 10}, // 大世界, 大世界
    {274, 412, 10}, // 豫园, 豫园
    {41, 413, 10},  // 陆家嘴, 陆家嘴
    {102, 415, 10}, // 浦东大道, 浦东大道
    {148, 419, 10}, // 云山路, 云山路
    {249, 420, 10}, // 蓝天路, 蓝天路
    {339, 438, 10}, // 桂林公园, 桂林公园
    {236, 439, 10}, // 桂林路, 桂林路
    {34, 443, 10},  // 娄山关路, 娄山关路
    {370, 445, 10}, // 大渡河路, 大渡河路
    {403, 447, 10}, // 铜川路, 铜川路
    {312, 448, 10}, // 上海西站, 上海西站
    {164, 455, 10}, // 顾村公园, 顾村公园
    {392, 457, 10}, // 华夏中路, 华夏中路
    {329, 458, 10}, // 罗山路, 罗山路
    {328, 489, 10}, // 御桥, 御桥
    {391, 490, 10}, // 莲溪路, 莲溪路
    {247, 495, 10}, // 杨高中路, 杨高中路
    {145, 496, 10}, // 民生路, 民生路
    {417, 497, 10}, // 昌邑路, 昌邑路
    {354, 500, 10}, // 江浦公园, 江浦公园
    {215, 501, 10}, // 江浦路, 江浦路
    {282, 503, 10}, // 国权路, 国权路
    {78, 507, 10},  // 长江南路, 长江南路
    {193, 508, 10}, // 沈杜公路, 沈杜公路
};

#define SH_STATIONS 514

const uint8_t line_station_nums[] = {28, 30, 29, 26, 19, 28, 33, 29, 35, 37, 39, 32, 31, 30, 30, 13, 13, 26, 6};

const uint16_t line_station_start[] = {0,   28,  58,  87,  113, 132, 160, 193, 222, 257,
                                       294, 333, 365, 396, 426, 456, 469, 482, 508};

const char stations[][45] = {
    "莘庄",
    "外环路",
    "莲花路",
    "锦江乐园",
    "上海南站",
    "漕宝路",
    "上海体育馆",
    "徐家汇",
    "衡山路",
    "常熟路",
    "陕西南路",
    "一大会址·黄陂南路",
    "人民广场",
    "新闸路",
    "汉中路",
    "上海火车站",
    "中山北路",
    "延长路",
    "上海马戏城",
    "汶水路",
    "彭浦新村",
    "共康路",
    "通河新村",
    "呼兰路",
    "共富新村",
    "宝安公路",
    "友谊西路",
    "富锦路",

    "徐泾东",
    "虹桥火车站",
    "虹桥2号航站楼",
    "淞虹路",
    "北新泾",
    "威宁路",
    "娄山关路",
    "中山公园",
    "江苏路",
    "静安寺",
    "南京西路",
    "人民广场",
    "南京东路",
    "陆家嘴",
    "东昌路",
    "世纪大道",
    "上海科技馆",
    "世纪公园",
    "龙阳路",
    "张江高科",
    "金科路",
    "广兰路",
    "唐镇",
    "创新中路",
    "华夏东路",
    "川沙",
    "凌空路",
    "远东大道",
    "海天三路",
    "浦东国际机场",

    "上海南站",
    "石龙路",
    "龙漕路",
    "漕溪路",
    "宜山路",
    "虹桥路",
    "延安西路",
    "中山公园",
    "金沙江路",
    "曹杨路",
    "镇坪路",
    "中潭路",
    "上海火车站",
    "宝山路",
    "东宝兴路",
    "虹口足球场",
    "赤峰路",
    "大柏树",
    "江湾镇",
    "殷高西路",
    "长江南路",
    "淞发路",
    "张华浜",
    "淞滨路",
    "水产路",
    "宝杨路",
    "友谊路",
    "铁力路",
    "江杨北路",

    "上海体育馆",
    "宜山路",
    "虹桥路",
    "延安西路",
    "中山公园",
    "金沙江路",
    "曹杨路",
    "镇坪路",
    "中潭路",
    "上海火车站",
    "宝山路",
    "海伦路",
    "临平路",
    "大连路",
    "杨树浦路",
    "浦东大道",
    "世纪大道",
    "浦电路",
    "蓝村路",
    "塘桥",
    "南浦大桥",
    "西藏南路",
    "鲁班路",
    "大木桥路",
    "东安路",
    "上海体育场",

    "莘庄",
    "春申路",
    "银都路",
    "颛桥",
    "北桥",
    "剑川路",
    "东川路",
    "金平路",
    "华宁路",
    "文井路",
    "闵行开发区",
    "江川路",
    "西渡",
    "萧塘",
    "奉浦大道",
    "环城东路",
    "望园路",
    "金海湖",
    "奉贤新城",

    "东方体育中心",
    "灵岩南路",
    "上南路",
    "华夏西路",
    "高青路",
    "东明路",
    "高科西路",
    "临沂新村",
    "上海儿童医学中心",
    "蓝村路",
    "浦电路",
    "世纪大道",
    "源深体育中心",
    "民生路",
    "北洋泾路",
    "德平路",
    "云山路",
    "金桥路",
    "博兴路",
    "五莲路",
    "巨峰路",
    "东靖路",
    "五洲大道",
    "洲海路",
    "外高桥保税区南站",
    "航津路",
    "外高桥保税区北站",
    "港城路",

    "美兰湖",
    "罗南新村",
    "潘广路",
    "刘行",
    "顾村公园",
    "祁华路",
    "上海大学",
    "南陈路",
    "上大路",
    "场中路",
    "大场镇",
    "行知路",
    "大华三路",
    "新村路",
    "岚皋路",
    "镇坪路",
    "长寿路",
    "昌平路",
    "静安寺",
    "常熟路",
    "肇嘉浜路",
    "东安路",
    "龙华中路",
    "后滩",
    "长清路",
    "耀华路",
    "云台路",
    "高科西路",
    "杨高南路",
    "锦绣路",
    "芳华路",
    "龙阳路",
    "花木路",

    "沈杜公路",
    "联航路",
    "江月路",
    "浦江镇",
    "芦恒路",
    "凌兆新村",
    "东方体育中心",
    "杨思成山路",
    "耀华路",
    "中华艺术宫",
    "西藏南路",
    "陆家浜路",
    "老西门",
    "大世界",
    "人民广场",
    "曲阜路",
    "中兴路",
    "西藏北路",
    "虹口足球场",
    "曲阳路",
    "四平路",
    "鞍山新村",
    "江浦路",
    "黄兴路",
    "延吉中路",
    "黄兴公园",
    "翔殷路",
    "嫩江路",
    "市光路",

    "松江南站",
    "醉白池",
    "松江体育中心",
    "松江新城",
    "松江大学城",
    "洞泾",
    "佘山",
    "泗泾",
    "九亭",
    "中春路",
    "七宝",
    "星中路",
    "合川路",
    "漕河泾开发区",
    "桂林路",
    "宜山路",
    "徐家汇",
    "肇嘉浜路",
    "嘉善路",
    "打浦桥",
    "马当路",
    "陆家浜路",
    "小南门",
    "商城路",
    "世纪大道",
    "杨高中路",
    "芳甸路",
    "蓝天路",
    "台儿庄路",
    "金桥",
    "金吉路",
    "金海路",
    "顾唐路",
    "民雷路",
    "曹路",

    "航中路",
    "紫藤路",
    "龙柏新村",
    "虹桥火车站",
    "虹桥2号航站楼",
    "虹桥1号航站楼",
    "上海动物园",
    "龙溪路",
    "水城路",
    "伊犁路",
    "宋园路",
    "虹桥路",
    "交通大学",
    "上海图书馆",
    "陕西南路",
    "一大会址·新天地",
    "老西门",
    "豫园",
    "南京东路",
    "天潼路",
    "四川北路",
    "海伦路",
    "邮电新村",
    "四平路",
    "同济大学",
    "国权路",
    "五角场",
    "江湾体育场",
    "三门路",
    "殷高东路",
    "新江湾城",
    "国帆路",
    "双江路",
    "高桥西",
    "高桥",
    "港城路",
    "基隆路",

    "花桥",
    "光明路",
    "兆丰路",
    "安亭",
    "上海汽车城",
    "昌吉东路",
    "上海赛车场",
    "嘉定北",
    "嘉定西",
    "白银路",
    "嘉定新城",
    "马陆",
    "陈翔公路",
    "南翔",
    "桃浦新村",
    "武威路",
    "祁连山路",
    "李子园",
    "上海西站",
    "真如",
    "枫桥路",
    "曹杨路",
    "隆德路",
    "江苏路",
    "交通大学",
    "徐家汇",
    "上海游泳馆",
    "龙华",
    "云锦路",
    "龙耀路",
    "东方体育中心",
    "三林",
    "三林东",
    "浦三路",
    "御桥",
    "罗山路",
    "秀沿路",
    "康新公路",
    "迪士尼",

    "七莘路",
    "虹莘路",
    "顾戴路",
    "东兰路",
    "虹梅路",
    "虹漕路",
    "桂林公园",
    "漕宝路",
    "龙漕路",
    "龙华",
    "龙华中路",
    "大木桥路",
    "嘉善路",
    "陕西南路",
    "南京西路",
    "汉中路",
    "曲阜路",
    "天潼路",
    "国际客运中心",
    "提篮桥",
    "大连路",
    "江浦公园",
    "宁国路",
    "隆昌路",
    "爱国路",
    "复兴岛",
    "东陆路",
    "巨峰路",
    "杨高北路",
    "金京路",
    "申江路",
    "金海路",

    "金运路",
    "金沙江西路",
    "丰庄",
    "祁连山南路",
    "真北路",
    "大渡河路",
    "金沙江路",
    "隆德路",
    "武宁路",
    "长寿路",
    "江宁路",
    "汉中路",
    "自然博物馆",
    "南京西路",
    "淮海中路",
    "一大会址·新天地",
    "马当路",
    "世博会博物馆",
    "世博大道",
    "长清路",
    "成山路",
    "东明路",
    "华鹏路",
    "下南路",
    "北蔡",
    "陈春路",
    "莲溪路",
    "华夏中路",
    "中科路",
    "学林路",
    "张江路",

    "封浜",
    "乐秀路",
    "临洮路",
    "嘉怡路",
    "定边路",
    "真新新村",
    "真光路",
    "铜川路",
    "真如",
    "中宁路",
    "曹杨路",
    "武宁路",
    "武定路",
    "静安寺",
    "一大会址·黄陂南路",
    "大世界",
    "豫园",
    "陆家嘴",
    "浦东南路",
    "浦东大道",
    "源深路",
    "昌邑路",
    "歇浦路",
    "云山路",
    "蓝天路",
    "黄杨路",
    "云顺路",
    "浦东足球场",
    "金粤路",
    "桂桥路",

    "紫竹高新区",
    "永德路",
    "元江路",
    "双柏路",
    "曙建路",
    "景西路",
    "虹梅南路",
    "华泾西",
    "朱梅路",
    "罗秀路",
    "华东理工大学",
    "上海南站",
    "桂林公园",
    "桂林路",
    "吴中路",
    "姚虹路",
    "红宝石路",
    "娄山关路",
    "长风公园",
    "大渡河路",
    "梅岭北路",
    "铜川路",
    "上海西站",
    "武威东路",
    "古浪路",
    "祁安路",
    "南大路",
    "丰翔路",
    "锦秋路",
    "顾村公园",

    "龙阳路",
    "华夏中路",
    "罗山路",
    "周浦东",
    "鹤沙航城",
    "航头东",
    "新场",
    "野生动物园",
    "惠南",
    "惠南东",
    "书院",
    "临港大道",
    "滴水湖",

    "虹桥火车站",
    "诸光路",
    "蟠龙路",
    "徐盈路",
    "徐泾北城",
    "嘉松中路",
    "赵巷",
    "汇金路",
    "青浦新城",
    "漕盈路",
    "淀山湖大道",
    "朱家角",
    "东方绿舟",

    "航头",
    "下沙",
    "鹤涛路",
    "沈梅路",
    "繁荣路",
    "周浦",
    "康桥",
    "御桥",
    "莲溪路",
    "北中路",
    "芳芯路",
    "龙阳路",
    "迎春路",
    "杨高中路",
    "民生路",
    "昌邑路",
    "丹阳路",
    "平凉路",
    "江浦公园",
    "江浦路",
    "抚顺路",
    "国权路",
    "复旦大学",
    "上海财经大学",
    "殷高路",
    "长江南路",

    "沈杜公路",
    "三鲁公路",
    "闵瑞路",
    "浦航路",
    "东城一路",
    "汇臻路",
};

const char station_pinyin[407][2][45] = {
    {"AT", "安亭"},
    {"BC", "北蔡"},
    {"BQ", "北桥"},
    {"CL", "曹路"},
    {"CS", "川沙"},
    {"DJ", "洞泾"},
    {"FB", "封浜"},
    {"FZ", "丰庄"},
    {"GQ", "高桥"},
    {"HN", "惠南"},
    {"HQ", "花桥"},
    {"HT", "后滩"},
    {"HT", "航头"},
    {"JQ", "金桥"},
    {"JT", "九亭"},
    {"KQ", "康桥"},
    {"LH", "刘行"},
    {"LH", "龙华"},
    {"ML", "马陆"},
    {"NX", "南翔"},
    {"QB", "七宝"},
    {"SJ", "泗泾"},
    {"SL", "三林"},
    {"SS", "佘山"},
    {"SY", "书院"},
    {"TQ", "塘桥"},
    {"TZ", "唐镇"},
    {"XC", "新场"},
    {"XD", "西渡"},
    {"XS", "下沙"},
    {"XT", "萧塘"},
    {"XZ", "莘庄"},
    {"YQ", "御桥"},
    {"YY", "豫园"},
    {"ZP", "周浦"},
    {"ZQ", "颛桥"},
    {"ZR", "真如"},
    {"ZX", "赵巷"},
    {"AGL", "爱国路"},
    {"BSL", "宝山路"},
    {"BXJ", "北新泾"},
    {"BXL", "博兴路"},
    {"BYL", "宝杨路"},
    {"BYL", "白银路"},
    {"BZL", "北中路"},
    {"CBL", "漕宝路"},
    {"CCL", "陈春路"},
    {"CFL", "赤峰路"},
    {"CPL", "昌平路"},
    {"CQL", "长清路"},
    {"CSL", "常熟路"},
    {"CSL", "成山路"},
    {"CSL", "春申路"},
    {"CSL", "长寿路"},
    {"CXL", "漕溪路"},
    {"CYL", "昌邑路"},
    {"CYL", "曹杨路"},
    {"CYL", "漕盈路"},
    {"CZL", "场中路"},
    {"DAL", "东安路"},
    {"DBL", "定边路"},
    {"DBS", "大柏树"},
    {"DCL", "东川路"},
    {"DCL", "东昌路"},
    {"DCZ", "大场镇"},
    {"DJL", "东靖路"},
    {"DLL", "东兰路"},
    {"DLL", "东陆路"},
    {"DLL", "大连路"},
    {"DML", "东明路"},
    {"DPL", "德平路"},
    {"DPQ", "打浦桥"},
    {"DSH", "滴水湖"},
    {"DSJ", "大世界"},
    {"DSN", "迪士尼"},
    {"DYL", "丹阳路"},
    {"FDL", "芳甸路"},
    {"FHL", "芳华路"},
    {"FJL", "富锦路"},
    {"FQL", "枫桥路"},
    {"FRL", "繁荣路"},
    {"FSL", "抚顺路"},
    {"FXD", "复兴岛"},
    {"FXL", "丰翔路"},
    {"FXL", "芳芯路"},
    {"GCL", "港城路"},
    {"GDL", "顾戴路"},
    {"GFL", "国帆路"},
    {"GKL", "共康路"},
    {"GLL", "古浪路"},
    {"GLL", "广兰路"},
    {"GLL", "桂林路"},
    {"GML", "光明路"},
    {"GQL", "国权路"},
    {"GQL", "桂桥路"},
    {"GQL", "高青路"},
    {"GQX", "高桥西"},
    {"GTL", "顾唐路"},
    {"HCL", "合川路"},
    {"HCL", "虹漕路"},
    {"HJL", "汇金路"},
    {"HJL", "航津路"},
    {"HJX", "华泾西"},
    {"HLL", "呼兰路"},
    {"HLL", "海伦路"},
    {"HML", "花木路"},
    {"HML", "虹梅路"},
    {"HND", "惠南东"},
    {"HNL", "华宁路"},
    {"HPL", "华鹏路"},
    {"HQL", "虹桥路"},
    {"HSL", "虹莘路"},
    {"HSL", "衡山路"},
    {"HTD", "航头东"},
    {"HTL", "鹤涛路"},
    {"HXL", "黄兴路"},
    {"HYL", "黄杨路"},
    {"HZL", "汇臻路"},
    {"HZL", "汉中路"},
    {"HZL", "航中路"},
    {"JAS", "静安寺"},
    {"JCL", "剑川路"},
    {"JCL", "江川路"},
    {"JDB", "嘉定北"},
    {"JDX", "嘉定西"},
    {"JFL", "巨峰路"},
    {"JHH", "金海湖"},
    {"JHL", "金海路"},
    {"JJL", "金京路"},
    {"JJL", "金吉路"},
    {"JKL", "金科路"},
    {"JLL", "基隆路"},
    {"JNL", "江宁路"},
    {"JPL", "江浦路"},
    {"JPL", "金平路"},
    {"JQL", "金桥路"},
    {"JQL", "锦秋路"},
    {"JSL", "嘉善路"},
    {"JSL", "江苏路"},
    {"JWZ", "江湾镇"},
    {"JXL", "景西路"},
    {"JXL", "锦绣路"},
    {"JYL", "嘉怡路"},
    {"JYL", "江月路"},
    {"JYL", "金粤路"},
    {"JYL", "金运路"},
    {"LBL", "鲁班路"},
    {"LCL", "蓝村路"},
    {"LCL", "隆昌路"},
    {"LCL", "龙漕路"},
    {"LDL", "隆德路"},
    {"LGL", "岚皋路"},
    {"LHL", "联航路"},
    {"LHL", "芦恒路"},
    {"LHL", "莲花路"},
    {"LJZ", "陆家嘴"},
    {"LKL", "凌空路"},
    {"LPL", "临平路"},
    {"LSL", "罗山路"},
    {"LTL", "临洮路"},
    {"LTL", "蓝天路"},
    {"LXL", "乐秀路"},
    {"LXL", "罗秀路"},
    {"LXL", "莲溪路"},
    {"LXL", "龙溪路"},
    {"LXM", "老西门"},
    {"LYL", "龙耀路"},
    {"LYL", "龙阳路"},
    {"LZY", "李子园"},
    {"MDL", "马当路"},
    {"MLH", "美兰湖"},
    {"MLL", "民雷路"},
    {"MRL", "闵瑞路"},
    {"MSL", "民生路"},
    {"NCL", "南陈路"},
    {"NDL", "南大路"},
    {"NGL", "宁国路"},
    {"NJL", "嫩江路"},
    {"PDL", "浦电路"},
    {"PGL", "潘广路"},
    {"PHL", "浦航路"},
    {"PJZ", "浦江镇"},
    {"PLL", "平凉路"},
    {"PLL", "蟠龙路"},
    {"PSL", "浦三路"},
    {"QAL", "祁安路"},
    {"QFL", "曲阜路"},
    {"QHL", "祁华路"},
    {"QSL", "七莘路"},
    {"QYL", "曲阳路"},
    {"SBL", "双柏路"},
    {"SBL", "淞滨路"},
    {"SCL", "商城路"},
    {"SCL", "水产路"},
    {"SCL", "水城路"},
    {"SDL", "上大路"},
    {"SFL", "淞发路"},
    {"SGL", "市光路"},
    {"SHL", "淞虹路"},
    {"SJL", "双江路"},
    {"SJL", "曙建路"},
    {"SJL", "申江路"},
    {"SLD", "三林东"},
    {"SLL", "石龙路"},
    {"SML", "三门路"},
    {"SML", "沈梅路"},
    {"SNL", "上南路"},
    {"SPL", "四平路"},
    {"SYL", "宋园路"},
    {"TCL", "铜川路"},
    {"TLL", "铁力路"},
    {"TLQ", "提篮桥"},
    {"TTL", "天潼路"},
    {"WDL", "武定路"},
    {"WHL", "外环路"},
    {"WJC", "五角场"},
    {"WJL", "文井路"},
    {"WLL", "五莲路"},
    {"WNL", "威宁路"},
    {"WNL", "武宁路"},
    {"WSL", "汶水路"},
    {"WWL", "武威路"},
    {"WYL", "望园路"},
    {"WZL", "吴中路"},
    {"XCL", "新村路"},
    {"XJD", "徐泾东"},
    {"XJH", "徐家汇"},
    {"XLL", "学林路"},
    {"XNL", "下南路"},
    {"XNM", "小南门"},
    {"XPL", "歇浦路"},
    {"XYL", "徐盈路"},
    {"XYL", "秀沿路"},
    {"XYL", "翔殷路"},
    {"XZL", "新闸路"},
    {"XZL", "星中路"},
    {"XZL", "行知路"},
    {"YCL", "延长路"},
    {"YCL", "迎春路"},
    {"YDL", "永德路"},
    {"YDL", "银都路"},
    {"YGL", "殷高路"},
    {"YHL", "姚虹路"},
    {"YHL", "耀华路"},
    {"YJL", "云锦路"},
    {"YJL", "元江路"},
    {"YLL", "伊犁路"},
    {"YSL", "云山路"},
    {"YSL", "云顺路"},
    {"YSL", "宜山路"},
    {"YSL", "源深路"},
    {"YTL", "云台路"},
    {"YYL", "友谊路"},
    {"ZBC", "醉白池"},
    {"ZBL", "真北路"},
    {"ZCL", "中春路"},
    {"ZFL", "兆丰路"},
    {"ZGL", "真光路"},
    {"ZGL", "诸光路"},
    {"ZHB", "张华浜"},
    {"ZHL", "洲海路"},
    {"ZJJ", "朱家角"},
    {"ZJL", "张江路"},
    {"ZKL", "中科路"},
    {"ZML", "朱梅路"},
    {"ZNL", "中宁路"},
    {"ZPD", "周浦东"},
    {"ZPL", "镇坪路"},
    {"ZTL", "中潭路"},
    {"ZTL", "紫藤路"},
    {"ZXL", "中兴路"},
    {"ASXC", "鞍山新村"},
    {"BAGL", "宝安公路"},
    {"BYJL", "北洋泾路"},
    {"CFGY", "长风公园"},
    {"CJDL", "昌吉东路"},
    {"CJNL", "长江南路"},
    {"CXGL", "陈翔公路"},
    {"CXZL", "创新中路"},
    {"DBXL", "东宝兴路"},
    {"DCYL", "东城一路"},
    {"DDHL", "大渡河路"},
    {"DFLZ", "东方绿舟"},
    {"DHSL", "大华三路"},
    {"DMQL", "大木桥路"},
    {"FDDX", "复旦大学"},
    {"FPDD", "奉浦大道"},
    {"FXXC", "奉贤新城"},
    {"GCGY", "顾村公园"},
    {"GFXC", "共富新村"},
    {"GKXL", "高科西路"},
    {"GLGY", "桂林公园"},
    {"HBSL", "红宝石路"},
    {"HCDL", "环城东路"},
    {"HHZL", "淮海中路"},
    {"HMNL", "虹梅南路"},
    {"HSHC", "鹤沙航城"},
    {"HTSL", "海天三路"},
    {"HXDL", "华夏东路"},
    {"HXGY", "黄兴公园"},
    {"HXXL", "华夏西路"},
    {"HXZL", "华夏中路"},
    {"JDXC", "嘉定新城"},
    {"JJLY", "锦江乐园"},
    {"JPGY", "江浦公园"},
    {"JSJL", "金沙江路"},
    {"JSZL", "嘉松中路"},
    {"JTDX", "交通大学"},
    {"JYBL", "江杨北路"},
    {"KXGL", "康新公路"},
    {"LBXC", "龙柏新村"},
    {"LGDD", "临港大道"},
    {"LHZL", "龙华中路"},
    {"LJBL", "陆家浜路"},
    {"LNXC", "罗南新村"},
    {"LSGL", "娄山关路"},
    {"LYNL", "灵岩南路"},
    {"LYXC", "临沂新村"},
    {"LZXC", "凌兆新村"},
    {"MLBL", "梅岭北路"},
    {"NJDL", "南京东路"},
    {"NJXL", "南京西路"},
    {"NPDQ", "南浦大桥"},
    {"PDDD", "浦东大道"},
    {"PDNL", "浦东南路"},
    {"PPXC", "彭浦新村"},
    {"QLSL", "祁连山路"},
    {"QPXC", "青浦新城"},
    {"RMGC", "人民广场"},
    {"SBDD", "世博大道"},
    {"SCBL", "四川北路"},
    {"SDGL", "沈杜公路"},
    {"SHDX", "上海大学"},
    {"SHNZ", "上海南站"},
    {"SHXZ", "上海西站"},
    {"SJDD", "世纪大道"},
    {"SJGY", "世纪公园"},
    {"SJNZ", "松江南站"},
    {"SJXC", "松江新城"},
    {"SLGL", "三鲁公路"},
    {"SXNL", "陕西南路"},
    {"TEZL", "台儿庄路"},
    {"THXC", "通河新村"},
    {"TJDX", "同济大学"},
    {"TPXC", "桃浦新村"},
    {"WWDL", "武威东路"},
    {"WZDD", "五洲大道"},
    {"XJBC", "徐泾北城"},
    {"XJWC", "新江湾城"},
    {"XZBL", "西藏北路"},
    {"XZNL", "西藏南路"},
    {"YAXL", "延安西路"},
    {"YDDD", "远东大道"},
    {"YDXC", "邮电新村"},
    {"YGBL", "杨高北路"},
    {"YGDL", "殷高东路"},
    {"YGNL", "杨高南路"},
    {"YGXL", "殷高西路"},
    {"YGZL", "杨高中路"},
    {"YJZL", "延吉中路"},
    {"YSPL", "杨树浦路"},
    {"YYXL", "友谊西路"},
    {"ZJBL", "肇嘉浜路"},
    {"ZJGK", "张江高科"},
    {"ZSBL", "中山北路"},
    {"ZSGY", "中山公园"},
    {"ZXXC", "真新新村"},
    {"DSHDD", "淀山湖大道"},
    {"HKZQC", "虹口足球场"},
    {"HQHCZ", "虹桥火车站"},
    {"JSJXL", "金沙江西路"},
    {"JWTYC", "江湾体育场"},
    {"MHKFQ", "闵行开发区"},
    {"PDZQC", "浦东足球场"},
    {"QLSNL", "祁连山南路"},
    {"SHDWY", "上海动物园"},
    {"SHHCZ", "上海火车站"},
    {"SHKJG", "上海科技馆"},
    {"SHMXC", "上海马戏城"},
    {"SHQCC", "上海汽车城"},
    {"SHSCC", "上海赛车场"},
    {"SHTSG", "上海图书馆"},
    {"SHTYC", "上海体育场"},
    {"SHTYG", "上海体育馆"},
    {"SHYYG", "上海游泳馆"},
    {"SJDXC", "松江大学城"},
    {"YSCSL", "杨思成山路"},
    {"YSDWY", "野生动物园"},
    {"ZHYSG", "中华艺术宫"},
    {"ZRBWG", "自然博物馆"},
    {"ZZGXQ", "紫竹高新区"},
    {"CHJKFQ", "漕河泾开发区"},
    {"DFTYZX", "东方体育中心"},
    {"GJKYZX", "国际客运中心"},
    {"HDLGDX", "华东理工大学"},
    {"PDGJJC", "浦东国际机场"},
    {"SBHBWG", "世博会博物馆"},
    {"SHCJDX", "上海财经大学"},
    {"SJTYZX", "松江体育中心"},
    {"YSTYZX", "源深体育中心"},
    {"HQ1HHZL", "虹桥1号航站楼"},
    {"HQ2HHZL", "虹桥2号航站楼"},
    {"YDHZXTD", "一大会址·新天地"},
    {"SHETYXZX", "上海儿童医学中心"},
    {"WGQBSQBZ", "外高桥保税区北站"},
    {"WGQBSQNZ", "外高桥保税区南站"},
    {"YDHZHBNL", "一大会址·黄陂南路"},
};